Revit 2027 API
EnergyDataSettings.UseHeatingCredits Property
 Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseHeatingCredits { get; set; }
Public Property UseHeatingCredits As Boolean
	Get
	Set
public:
property bool UseHeatingCredits {
	bool get ();
	void set (bool value);
}
member UseHeatingCredits : bool with get, set
Property Value
Boolean
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace